# Deal with Null Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
 
data = {
    'Name': ['a', 'b', 'c', 'd'],
    'science': [80, np.NaN, 68, np.NaN],
    'Maths': [66, 54, 77, 64]
}

df = pd.DataFrame(data)
print(df)

  Name  science  Maths
0    a     80.0     66
1    b      NaN     54
2    c     68.0     77
3    d      NaN     64

In [3]:
# To check null values in Data frame

df.isnull()

    Name  science  Maths
0  False    False  False
1  False     True  False
2  False    False  False
3  False     True  False

In [4]:
# To check number of null values column wise

df.isnull().sum()

Name       0
science    2
Maths      0
dtype: int64

In [5]:
# To check fetch only null value data

df[df["science"].isnull()]

  Name  science  Maths
1    b      NaN     54
3    d      NaN     64

In [6]:
# For Not Null

df.notnull()

   Name  science  Maths
0  True     True   True
1  True    False   True
2  True     True   True
3  True    False   True

# Replace null values

In [7]:
# Replace null value - Method of Forward fill

df.fillna(method='ffill')

  Name  science  Maths
0    a     80.0     66
1    b     80.0     54
2    c     68.0     77
3    d     68.0     64

In [8]:
# Replace null value - Method of Backward fill

df.fillna(method='bfill')

  Name  science  Maths
0    a     80.0     66
1    b     68.0     54
2    c     68.0     77
3    d      NaN     64

In [9]:
# Replace missing values with Zero

df.fillna(0)

  Name  science  Maths
0    a     80.0     66
1    b      0.0     54
2    c     68.0     77
3    d      0.0     64

In [10]:
# Replace Missing values with Average

df.fillna(np.mean(df))

  Name  science  Maths
0    a     80.0     66
1    b     74.0     54
2    c     68.0     77
3    d     74.0     64

In [11]:
# Replace missing values with Iterpolate method
# It is useful when the data is a time series or having some trend
# It will replace values based on the trend of the data

df.interpolate()

  Name  science  Maths
0    a     80.0     66
1    b     74.0     54
2    c     68.0     77
3    d     68.0     64